Revit 2027 API
BuiltInFailures.StructuralSectionsFailures Class
 Failures about Structural Sections.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralSectionsFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class StructuralSectionsFailures
Public NotInheritable Class StructuralSectionsFailures
public ref class StructuralSectionsFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralSectionsFailures = class end
The BuiltInFailures.StructuralSectionsFailures type exposes the following members.
Properties
Name | Description
StructuralSectionCannotBeDetermined |  The section cannot be determined.
StructuralSectionShapesDoNotMatch |  Family Shape does not match the geometry of the element.
Top
See Also
Reference
Autodesk.Revit.DB Namespace